### Задание 1

In [25]:
import pandas as pd

In [26]:
authors = pd.DataFrame({'author_id': [1,2,3], 'author_name': ['Тургенев', 'Чехов', 'Островский']})
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3], 'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price': [450, 300, 350, 500, 450, 370, 290]})

In [27]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [28]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [29]:
authors_price = pd.merge(authors, book, on='author_id', how='left')
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [30]:
top_5 = authors_price.sort_values(by='price', inplace=False).tail()

In [31]:
top_5

   author_id author_name         book_title  price
2          1    Тургенев  Дворянское гнездо    350
5          3  Островский              Гроза    370
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
3          2       Чехов   Толстый и тонкий    500

### Задание 4

In [57]:
authors_stat = pd.DataFrame({'author_name': authors['author_name']})
min_price = authors_price.groupby('author_name').agg({'price': 'min'})
min_price = min_price.rename(columns={'price': 'min_price'})
max_price = authors_price.groupby('author_name').agg({'price': 'max'})
max_price = max_price.rename(columns={'price': 'max_price'})
mean_price = authors_price.groupby('author_name').agg({'price': 'mean'})
mean_price = mean_price.rename(columns={'price': 'mean_price'})
authors_stat = pd.merge(authors_stat, min_price, on='author_name', how='inner')
authors_stat = pd.merge(authors_stat, max_price, on='author_name', how='inner')
authors_stat = pd.merge(authors_stat, mean_price, on='author_name', how='inner')

authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        300        450  366.666667
1       Чехов        450        500  475.000000
2  Островский        290        370  330.000000